# FindHostPanel Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
Panel..::..FindHostPanel Method
Panel Class See Also
---
Finds the id of the host panel (i.e., wall) associated with this panel. If a host panel is present, then it is displayed instead of the curtain panel.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015
# Syntax
C#
---
```text
public ElementId FindHostPanel()
```

Visual Basic
---
```text
Public Function FindHostPanel As ElementId
```

Visual C++
---
```text
public:
ElementId^ FindHostPanel()
```

# ### Return Value
Element id of the host panel associated with this panel. Otherwise, InvalidElementId is returned
# See Also
Panel Class
Autodesk.Revit.DB Namespace